package com.pavel.likholap.lesson7

fun main() {
//Напишите цикл for, который выводит числа от 1 до 5.
    for (i in 1..5){
        println(i)
    }

//Напишите цикл for, который выводит четные числа от 1 до 10.
    for (i in 1..10){
        println(if (i % 2 == 0) i else continue)
    }

//Создайте цикл for, который выводит числа от 5 до 1.
    for (i in 5 downTo 1){
        println(i)
    }

//Создайте цикл for, который выводит числа от 10 до 1, уменьшая их на 2.
    for (i in 10 downTo 1){
        println(i - 2)
    }

//Используйте цикл for с шагом 2 для вывода чисел от 1 до 9.
    for (i in 1..9 step 2){
        println(i)
    }

//Напишите цикл for, который выводит каждое третье число в диапазоне от 1 до 20.
    for (i in 1..20 step 3){
        println(i)
    }

//Используйте цикл for и until, чтобы вывести числа из диапазона 1-9 (9 не включается).
    for (i in 1 until  9){
        println(i)
    }

//Напишите цикл for с until, чтобы вывести числа от 3 до 15, не включая 15.
    for (i in 3 until  15){
        println(i)
    }

//Создайте цикл while, который выводит квадраты чисел от 1 до 5.
    var a = 1
    while (a <= 5){
        println(a * a++)
    }

//Напишите цикл while, который уменьшает число от 10 до 5. После этого вывести результат в консоль
    var b = 10
    while (b > 5){
        b--
    }
    println(b)

//Используйте цикл do...while, чтобы вывести числа от 5 до 1.
    var c = 5
    do{
        println(c--)
    } while (c >= 1)

//Создайте цикл do...while, который повторяется, пока счетчик меньше 10, начиная с 5.
    var d = 5
    do{
        d++
    } while (d < 10)

//Напишите цикл for от 1 до 10 и используйте break, чтобы выйти из цикла при достижении 6.
    for (i in 1..10){
        println(if (i in 1..5) i else break)
    }

//Создайте цикл while, который бесконечно выводит числа, начиная с 1, но прерывается при достижении 10.
    var e = 1
    while (true){
        println(if (e == 10) break else e++)
    }

//В цикле for от 1 до 10 используйте continue, чтобы пропустить четные числа.
    for (i in 1..10){
        println(if (i % 2 == 0) continue else i)
    }

//Напишите цикл while, который выводит числа от 1 до 10, но пропускает числа, кратные 3.
    var f = 1
    while (f <= 10){
        println(if (f % 3 == 0) {f++
            continue} else f++)
    }

/*
Создать цикл в цикле, в каждом использовать диапазон от 0 до 10.
В консоль вывести результат умножения переменных цикла. Результат умножения выводить через print() и добавлять
ещё один print(“ ”) с пробелом, чтобы отделять значения в строку. После вложенного цикла выводить пустой println()
чтобы следующий проход начинать с новой строки. Результат должен быть как на картинке.
 */
    for (i in 1..10){
        for (j in 1..10){
            val res = i * j
            print("$res ")
        }
        println()
    }

//Вывод чисел от 1 до 10: Напишите программу, которая выводит числа от 1 до 10 с использованием цикла while.

    var g = 1
    while (g <= 10){
        println(g++)
    }

//Четные числа до 20: Используя цикл while, выведите все четные числа от 2 до 20.

    var h = 2
    while (h <= 20){
        println(if (h % 2 !=0) {h++
            continue} else h++)
    }

//Сумма чисел от 1 до 50: Напишите программу, которая суммирует числа от 1 до 50 с помощью цикла while.

    var i = 1
    while (i != 50){
        i += 1
    }

//Вывод чисел от 10 до 1: Используя цикл do while, выведите числа от 10 до 1

    var j = 10
    do{
        println(j--)
    } while (j >= 1)

//Факториал числа 5: Напишите программу, которая вычисляет факториал числа 5 с использованием цикла while.

    var k = 1
    var res = 1
    while (k != 5){
        res *= k + 1
        k += 1
    }
    print(res)

//Сумма четных чисел до 100: Используя цикл while, найдите сумму всех четных чисел от 2 до 100

    var l = 2
    res = 0
    while (l <= 100){
        res += l
        l += 2}

//Таблица умножения на 3: Напишите программу, которая выводит таблицу умножения на 3

    for (ii in 1..3) {
        for (jj in 1..3) {
            val result = ii * jj
            print("$result ")}
        println()}

//Вывод символов до точки: Используя цикл do while, выведите символы строки "Kotlin." по одному до точки.

        var strIndex = 0
        val str = "Kotlin."
        while (true) {
            if (strIndex == str.lastIndex) {
                break
            } else (println(str[strIndex++]))

        }

/*Наибольшее число из списка: Напишите программу, которая находит наибольшее
число из заданного списка чисел с использованием цикла while.
Пример списка: [5, 12, 7, 22, 9]
*/

        val lst = listOf(5, 12, 7, 22, 9)
        var lstIndex = 0
        var max = 0
        while (lstIndex != lst.lastIndex) {
            if (max < lst[lstIndex]) {
                max = lst[lstIndex++]
            } else {
                lstIndex++
            }
        }
        println(max)

//Генерация чисел до 15: Используя цикл do while, напишите программу, которая генерирует и выводит числа от 1 до 15.

        var m = 1
        do {
            println(m++)
        } while (m < 16)

//Простые числа до 20: Напишите программу, которая выводит все простые числа до 20 с использованием цикла while.

        var n = 2
        while (n <= 20) {
            var nIsPrime = true
            for (i in 2 until n) {
                if (n % i == 0) {
                    nIsPrime = false
                    break
                }
            }
            if (nIsPrime) {
                println(n)
            }
            n++
        }

//Обратный порядок элементов массива: Создайте массив из 10 элементов и выведите его элементы
// в обратном порядке с помощью цикла while.

        val arr: Array<Int> = arrayOf(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
        var o = 9
        while (o >= 0) {
            println(arr[o--])
        }

//Количество итераций до 100: Напишите программу, которая увеличивает
// счетчик на 1 в цикле while до тех пор, пока значение счетчика не достигнет 100. Выведите количество итераций.

        var p = 1
        while (p < 100) {
            p++
        }
        println(p)

//Прямоугольник из символов: Используя вложенные циклы while, выведите прямоугольник размером 5x3 из символов *

        var r = 1
        while (r <= 5) {
            println("***")
            r++
        }

//Числа Фибоначчи до 50: Напишите программу, которая выводит все числа Фибоначчи,
// не превышающие 50, с использованием цикла while.

        var fst = 0
        var scd = 1
        while (scd < 50) {
            println(scd)
            val next = fst + scd
            fst = scd
            scd = next
        }

//Счетчик шагов: Создайте программу, которая считает шаги от 0 до 30 с шагом 5, используя цикл while.
        var s = 0
        while (s <= 30) {
            println(s)
            s += 5
        }

//Среднее значение фиксированного списка чисел: Найдите среднее значение чисел из списка [4, 8, 15, 16, 23, 42]
// с помощью цикла while.

        var common = 0
        val lst1: List<Int> = listOf(4, 8, 15, 16, 23, 42)
        var counter = 0
        while (counter <= lst1.lastIndex) {
            common += lst1[counter++]
        }
        println((common / lst1.size))

//Таблица умножения с вложенными циклами: Используя вложенные циклы do while, напишите программу
// для вывода таблицы умножения от 1 до 5

    var i1 = 1
    do {
        var j1 = 1
        do {
            print("${i1 * j1}\t")
            j1++
        } while (j1 <= 5)
        println()
        i1++
    } while (i1 <= 5)

//Сумма чисел в диапазоне: Напишите программу, которая находит сумму чисел от 10 до 30 с использованием цикла while.
    var x = 10
    var commonSum = 0
    while (x<= 30){
        commonSum += x++
    }
    println(commonSum)

//Сумма четных и нечетных чисел: Используя цикл while, найдите отдельно сумму четных и сумму нечетных чисел от 1 до 20.
    var evens = 0
    var odds = 0
    var w = 1
    while (w <= 20){
        if (w % 2 == 0){
            evens += w++
        } else {
            odds += w++
        }
    }
    println("evens_sum: $evens, odds_sum: $odds")

}
